openfoam/NASA_hump_data_jan25_fine/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "2406";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
69120
(
(0.0152671 2.9343081e-07 0)
(0.018559058 -3.8815965e-07 0)
(0.032127012 -6.6640116e-07 0)
(0.051938473 -7.6011372e-07 0)
(0.074681729 -7.5624074e-07 0)
(0.099817623 -7.3915294e-07 0)
(0.12757538 -7.225162e-07 0)
(0.15818531 -6.9785247e-07 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
96
(
(0.01709894 0 0)
(0.053006195 0 0)
(0.092510516 0 0)
(0.13596981 0 0)
(0.18377707 0 0)
(0.23636374 0 0)
(0.29420327 0 0)
(0.35781511 0 0)
...
)
;
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    hump
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
