openfoam/NASA_hump_data_jan25_fine/0/force
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "2406";
    object      force;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    bottomWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    hump
    {
        type            calculated;
        value           nonuniform List<vector> 
320
(
(0.014786718 -0.14132639 1.3824017e-20)
(0.022795728 -0.14414106 2.7520575e-20)
(0.032012874 -0.14951242 -3.0347371e-21)
(0.041718166 -0.15219642 6.0723946e-21)
(0.051893373 -0.15471014 5.3275876e-26)
(0.061474033 -0.15584437 1.1748226e-19)
(0.070280237 -0.1559874 -6.1139504e-20)
(0.077848014 -0.15486572 -5.2116865e-26)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
