openfoam/NASA_hump_data_jan25_fine/0/initialResidual:Ux
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "2406";
    object      initialResidual:Ux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
69120
(
-7.2634519e-14
-9.4533498e-14
-6.9250974e-15
4.3273816e-14
7.0808604e-13
-3.5496389e-13
3.0687035e-12
-1.2104499e-12
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    hump
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
