openfoam/NASA_hump_data_jan25_fine/0/initialResidual:p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "2406";
    object      initialResidual:p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
69120
(
5.2316294e-13
8.2461089e-13
5.794169e-13
5.6215365e-13
1.3962304e-12
1.6137844e-12
1.5087759e-12
1.6981402e-12
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    hump
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
