openfoam/NASA_hump_data_jan25_fine/0/moment
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "2406";
    object      moment;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    bottomWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    hump
    {
        type            calculated;
        value           nonuniform List<vector> 
320
(
(0.0070663197 0.00073933591 -0.00036671188)
(0.0072070529 0.0011397864 -0.0011407324)
(0.0074756208 0.0016006437 -0.0020179223)
(0.0076098211 0.0020859083 -0.0029523141)
(0.0077355072 0.0025946687 -0.0039713603)
(0.0077922186 0.0030737016 -0.0050412388)
(0.0077993702 0.0035140118 -0.0061559197)
(0.0077432858 0.0038924007 -0.0072839143)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
