openfoam/NASA_hump_data_jan25_fine/0/pWall
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "2406";
    object      pWall;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
69120
(
21.457808
22.075816
23.682145
25.678494
27.462042
29.001935
30.360974
31.500441
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
380
(
21.612
22.321568
23.777037
25.62191
27.397406
28.952663
30.301747
31.445483
...
)
;
    }
    hump
    {
        type            calculated;
        value           nonuniform List<scalar> 
320
(
222.87005
224.81089
226.26431
227.27569
227.23783
226.17483
223.69496
219.49826
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
