openfoam/NASA_hump_data_jan25_fine/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "2406";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
137424
(
1.6816637e-08
2.8390377e-10
2.4918979e-08
-8.1015157e-09
4.1426232e-08
-1.6506676e-08
6.2627354e-08
-2.1200559e-08
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
-1.7100017e-08
-5.8352056e-08
-1.1210444e-07
-1.8137455e-07
-2.6985306e-07
-3.8204898e-07
-5.2346525e-07
-7.0081147e-07
...
)
;
    }
    topWall
    {
        type            symmetry;
        value           uniform 0;
    }
    jet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
3.5906449e-07
1.2255932e-06
2.3549131e-06
3.8087115e-06
5.6573282e-06
7.9735745e-06
1.0818091e-05
1.4215386e-05
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    hump
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
