openfoam/NASA_hump_data_jan25_fine/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "2406";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
380
(
(-0.046635 -1.361791e-06 0)
(-0.056690639 5.7680303e-06 0)
(-0.098135413 1.0258265e-05 0)
(-0.15865165 1.1692329e-05 0)
(-0.22812337 1.1667459e-05 0)
(-0.30490366 1.1419289e-05 0)
(-0.38969271 1.1165551e-05 0)
(-0.48319405 1.0790138e-05 0)
...
)
;
    }
    hump
    {
        type            calculated;
        value           nonuniform List<vector> 
320
(
(-0.0063710337 -0.00048495242 -2.1864053e-17)
(-0.093014408 -0.01469278 -4.2187709e-17)
(-0.082953593 -0.017841052 -8.2981235e-17)
(-0.13886339 -0.037961389 1.6092421e-16)
(-0.18138607 -0.060566116 -7.4328525e-23)
(-0.24395779 -0.095531897 1.6455464e-22)
(-0.31271524 -0.1395998 -7.2246999e-17)
(-0.39765889 -0.19763713 6.616483e-23)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
