openfoam/NASA_hump_data_jan25_fine/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "2406";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
380
(
0.070696933
0.077947153
0.10255515
0.13039678
0.15636137
0.18076981
0.20436463
0.22756495
...
)
;
    }
    hump
    {
        type            calculated;
        value           nonuniform List<scalar> 
320
(
0.026291896
0.10063179
0.094908706
0.12233023
0.13896461
0.15985408
0.17922546
0.19989627
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
